[
  {
    "id": 10,
    "title": "Station météorologique connectée",
    "bio": "Développement d'une application de station météorologique connectée à des capteurs.",
    "badge": "New",
    "tags": ["BUT3"],
    "body": [
      {"title": "Contexte", "description": "Ce projet de 3ème année de BUT Informatique consiste au développement d'une application complexe utilisant des micro-controlleurs. Le sujet est libre mais il est contraint par l'utilisation d'un code source et le développement sous forme de micro services pour une intégration continue dans le futur."},
      {"title": "Choix du sujet", "description": "Notre groupe de développeurs à decider de créer une station météorologique connectée avec des capteurs météorologiques. Ce projet implique le développement de plusieurs instances :\n\n- Un serveur central de traitement des données\n- Des micro controlleurs\n- Une API de gestion des requêtes\n- Une base de données\n- Un client web\n- Un serveur de traitement d'images\n-Un client mobile (IOS)"},
      {"title": "🔁 Serveur de traitement", "description": "Le serveur de traitement des données Java permet de centraliser les connexions TCP des micro controlleurs afin de récuperer les données météorologiques et les enregistrer via une requête API ou directement dans la base de données via des drivers.\n\nIl nécessite le développement de threads client/server de connexion TCP et un système de gestion des requêtes."},
      {"title": "🛜 Micro controlleurs", "description": "Les micro controlleurs ont été développer avec le language Arduino et des cartes compatibles capables de créer une connexion TCP avec le serveur comme l'ESP32. Plusieurs capteurs sont branchés sur cette carte et fournissent des données météorologiques tel que la température, l'humidité, la pression, etc.\n\nL'utilisation de ces cartes nécessite le développement d'un système de connexion TCP notamment via le WIFI."},
      {"title": "🔀 API", "description": "L'API développée en NodeJS permet de réceptionner les requêtes du serveur afin de les traiter et enregistrer les données dans la base de données. Il permet également de gérer les requêtes des clients web ou mobile pour leur données accès aux données de la base.\n\nCette instance nécessite la création de plusieurs routes et services ainsi que l'implémentation d'une connexion entre API et Base de données."},
      {"title": "🌐 Client Web", "description": "Un client Web à été créer en VueJS pour afficher les données météorologiques enregistrées.\n\nLe développement du client implique la création de graphiques interactifs mis à jour automatiquement avec l'ajout de nouvelles données des capteurs."},
      {"title": "📷 Serveur multimédia", "description": "Le serveur multimédia permet d'analyser des images via un modèle de machine learning développer par nous même et de dire avec un certains pourcentage de confiance si il fait beau ou non (analyse de temps).\n\nCe serveur nécessite la création et l'entrainement d'un modèle ML ainsi qu'une connexion Client Mobile/Serveur Multi et Serveur Multi/Serveur TCP."},
      {"title": "📱 Client mobile", "description": "Le client mobile est seulement utilisé pour prendre une photo du ciel avec un téléphone et d'envoyer la photo au serveur multimédia afin de l'analyser.\n\nLe développement du client mobile nécessite la création d'une application swift et de sa connexion avec le serveur multi."},
      {"title": "Difficultés", "description": "Le développement de notre station météorologique connectée a présenté plusieurs difficultés globales. Tout d'abord, l'intégration des divers composants du projet, tels que les micro-contrôleurs, les capteurs météorologiques, le serveur de traitement des données, et les interfaces client, a été un défi majeur. La communication entre ces éléments hétérogènes a nécessité une compréhension approfondie des protocoles réseau et une gestion rigoureuse des connexions pour garantir la fiabilité et la précision des données.\n\nEnsuite, la conception et le développement de l'API en NodeJS et des interfaces utilisateur (web et mobile) ont été complexes. Assurer une interaction fluide et efficace entre le serveur, l'API, et les bases de données a demandé une structuration minutieuse des routes et des services, ainsi qu'une optimisation continue des performances.\n\nDe plus, l'élaboration du modèle de machine learning pour l'analyse des images météorologiques a posé des problèmes techniques, tant au niveau de l'entraînement du modèle que de son intégration avec le reste du système. L'assurance de la synchronisation des données entre toutes les composantes a également été un point critique, nécessitant des ajustements constants pour maintenir la cohérence et la réactivité de l'application."},
      {"title": "Bilan", "description": "Malgré les nombreuses difficultés rencontrées, le projet de station météorologique connectée a été un succès global et nous a permis d'acquérir de précieuses compétences :\n\n- Compétences techniques renforcées :\n\nLe développement des différentes composantes du projet nous a permis de renforcer nos compétences en programmation (Java, NodeJS, VueJS, Swift), en gestion de bases de données, en communication réseau (TCP/IP), et en machine learning.\nLa manipulation et l'intégration des micro-contrôleurs et des capteurs ont enrichi notre expérience en électronique et en systèmes embarqués.\n\n- Travail d'équipe et gestion de projet :\n\nLa collaboration au sein de notre groupe a été essentielle pour surmonter les défis. Nous avons appris à mieux communiquer, à partager les tâches et à coordonner nos efforts pour respecter les délais.\nL'utilisation de méthodologies agiles et d'outils de gestion de projet nous a aidés à organiser notre travail et à suivre l'avancement du projet de manière efficace.\n\n- Création d'une solution fonctionnelle et innovante :\n\nNous avons réussi à créer une station météorologique connectée intégrant des fonctionnalités avancées, telles que l'analyse d'images pour la prévision météo.\nLe système final est capable de centraliser les données météorologiques, de les afficher en temps réel via un client web et d'offrir une interface mobile intuitive pour l'envoi et l'analyse des photos du ciel.\n\n- Perspectives futures :\n\nCe projet ouvre la voie à de nombreuses améliorations et extensions possibles, comme l'ajout de nouveaux types de capteurs, l'amélioration du modèle de machine learning, ou encore le développement d'une application Android.\nL'architecture modulaire basée sur des micro-services facilitera l'intégration continue et l'évolution du système dans le futur."}
    ],
    "competences": [
      "Serveur TCP",
      "Machine Learning (ML)",
      "Dev. Web",
      "Dev. Mobile",
      "Docker",
      "Java",
      "Python",
      "Nodejs",
      "Vuejs",
      "Swift",
      "Mongodb"
    ],
    "images": {
      "Accueil": "images/projects/BUT/BUT3/sae-but3_home.png",
      "Connexion": "images/projects/BUT/BUT3/sae-but3_login.png",
      "Modules": "images/projects/BUT/BUT3/sae-but3_modules.png",
      "Graphe": "images/projects/BUT/BUT3/sae-but3_graphe.png"
    }
  },
  {
    "id": 9,
    "title": "Application web mobile",
    "bio": "Développement d'une application web mobile android.",
    "image": "images/projects/BUT/BUT2/sae-but2-2_home2.png",
    "tags": ["BUT2"],
    "body": [
      {"title": "Contexte", "description": "Ce projet de 2ème année de BUT Informatique fait suite au projet de création d'une application Web pour l'organisation d'une manifestation rélisé en BUT2. Il consiste au développement d'une application Mobile reprenant certaines fonctionnalités implémentées sur le site web."},
      {"title": "Choix du sujet", "description": "Ce projet a dû être développé en binôme et nous devions recréer une carte interactive et la possibilité d'avoir accès à l'ensemble des informations des manèges. Nous avons décider de développer une application android avec le langage Kotlin."},
      {"title": "Difficultés", "description": "La principale difficulté de cette partie du projet est l'utilisation d'un nouveau langage de programmation (Kotlin) mais également une nouvelle manière de développer (développement mobile). Ce projet a donc nécessité une montée en compétences et en connaissances.\n\nLe développement Android est complexe car il met en relation beaucoup d'instances et utilise une structure qui lui est propre et qu'il faut s'approprier. Ce projet m'a donc permis de comprendre le fonctionnement d'une application mobile mais également de développer sous une nouvelle forme."},
      {"title": "Bilan", "description": "Ce projet m'a permis de découvrir un nouvel aspect du développement et de concevoir une application mobile complémentaire du site web implémenté auparavant. J'ai également pu monter en compétences notamment grâce à la découverte du langage Kotlin et de la programmation sous Android."}
    ],
    "competences": [
      "Conception d'une application mobile",
      "Développement Android",
      "Kotlin",
      "Responsive UI/UX",
      "Elaboration d'une charte graphique"
    ],
    "images": {
      "Page d'accueil": "images/projects/BUT/BUT2/sae-but2-2_home.jpg",
      "Carte interactive": "images/projects/BUT/BUT2/sae-but2-2_map.jpg",
      "Liste des attractions": "images/projects/BUT/BUT2/sae-but2-2_attractions.jpg"
    }
  },
  {
    "id": 8,
    "title": "Application web",
    "bio": "Développement d'une application web complexe de gestion d'une manifestation.",
    "image": "images/projects/BUT/BUT2/sae-but2-1_home.png",
    "tags": ["BUT2"],
    "body": [
      {"title": "Contexte", "description": "Ce projet de 2ème année de BUT Informatique a pour objectif de développer une application web au sein d'un groupe de développeurs. L'objectif est d'imaginer une manifestation pour laquelle nous devions créer et élaborer un site web complet permettant sa gestion et son organisation. Il doit permettre d'apporter des fonctionnalités à la fois pour les usagers visiteurs mais également pour les administrateurs de l'événement et les prestataires."},
      {"title": "Choix du sujet", "description": "Afin de répondre au mieux aux attentes du projet, nous avons décider de créer une application web permettant l'organisation d'une fête foraine dans le centre ville de Belfort (90). Ainsi les visiteurs pourront directement avoir des informations sur les emplacements prévus. Les prestataires sont les forains qui s'occupent de stands, de manèges ou d'un groupe d'artistes et les organisateurs peuvent contrôler le placement des forains sur le site et le planning de la scène de spectacle."},
      {"title": "Conception du Modèle Conceptuel de Données (MCD)", "description": "La première étape de notre projet était de concevoir un modèle de données permettant de répondre aux différents choix du sujet. Nous avons donc construit un premier MCD en recopiant de manière linéaire les différentes fonctionnalités voulues (MCD1)\n\nAprès avoir analysé notre modèle, nous nous sommes aperçu de plusieurs incohérences notamment dues au fait que nous n'avions pas nous-mêmes défini clairement et précisément le lien entre chaque fonctionnalité et chaque table. Ainsi, nous avons apporté plusieurs modifications pour aboutir à un modèle plus précis et correspondant le mieux à notre projet (MCD2)."},
      {"title": "Développement", "description": "L'application s'inspire du modèle API Rest pour lequel chaque requête du client passe par le serveur API qui lui-même interroge la base de données et renvoie la réponse au client. Les langages utilisés sont:\n\n- Client: VueJS\n- Server: NodeJS\n- BDD: Postgresql\n\nAinsi afin de développer l'ensemble des fonctionnalités de notre application, nous avons décidé de diviser le travail par catégories sachant qu'il y en a 3 différentes: visiteurs, prestataires et organisateurs.\n\nL'avantage de cette répartition des tâches est que chaque personne apporte une vision différente de l'autre et en cas de problème, le développeur bloqué peut demander l'avis d'un autre qui n'a pas travaillé sur les mêmes fonctionnalités, il apporte donc une vision différente avec un autre angle de vue. Cela nous a permis d'avancer tous ensemble, chacun sur des fonctions différentes mais tous dans la même direction."},
      {"title": "🧑🏼 Prestataires", "description": "Le but pour les prestataires est de pouvoir s'inscrire sur un emplacement pendant un certains temps lors de la fête foraine. Ansi nous avons décidé de créer un compte prestataire dans lequel ce dernier peut référencer ses stands, ses manèges et ses groupes d'artistes. Il peut ensuite effectuer une demande d'inscription qui sera transmise aux organisateurs."},
      {"title": "👩🏼 Organisateurs", "description": "Les organisateurs ont la possibilité de gérer l'ensemble des prestataires à travers un tableau de bord et ainsi d'inscrire ou non un forain sur un emplacement pour une date donnée."},
      {"title": "👨🏼 Visiteurs", "description": "Les visiteurs doivent avoir accès à une carte interactive afin de visualiser l'ensemble des stands, des manèges et des groupes présents à une date précise et sur quel emplacement. De plus ils peuvent attribuer des notes et des commentaires aux forains."},
      {"title": "Organisation", "description": "La réalisation de ce projet m'a permis d'apprendre à travailler dans une équipe informatique tout en planifiant l'avancement. Pour cela, nous avons utilisé une méthode agile en travaillant par sprint afin d'incrémenter le projet de nouvelles fonctionnalités. J'ai pu produire plusieurs documents afin de suivre la réalisation du site web comme un burnup chart."},
      {"title": "Difficultés", "description": "La réalisation de ce projet m'a permis de me confronter à de nouvelles difficultés notamment celles de développer une carte interactive. En effet, n'ayant aucune connaissance sur ce type de développement, cela a nécessité en amont une phase de documentation et d'analyse de ma part. J'ai ensuite pu procéder par étape en réalisant des maquettes et au fur et à mesure, j'ai ajouté des fonctionnalités pour aboutir à la carte interactive définitive, connectée à la base de données et qui se met à jour automatiquement."},
      {"title": "Bilan", "description": "Ce projet m'a permis de réaliser une application web du début à la fin au sein d'une équipe informatique. J'ai ainsi pu développer mes compétences tant au niveau du développement pur en travaillant sur de nouveaux langages tels que VueJS, NodeJS ou Postgres, mais également au niveau de la méthodologie de conduite de projet agile.\n\nLes difficultés ont pu être surmontées à travers une montée en compétences notamment grâce à de la documentation mais aussi à l'entraide entre les membres de l'équipe."}
    ],
    "competences": [
      "Travail en équipe",
      "Gestion de projet agile",
      "Analyse d'un besoin",
      "Conception d'une solution applicative",
      "VueJS",
      "NodeJS",
      "NodeJS",
      "Création d'un site web complet",
      "Création d'une carte interactive",
      "Documentation de code",
      "Elaboration de rapports techniques"
    ],
    "images": {
      "MCD1": "images/projects/BUT/BUT2/sae-but2-1_mcd1.png",
      "MCD2": "images/projects/BUT/BUT2/sae-but2-1_mcd2.png",
      "Préstataires - attractions": "images/projects/BUT/BUT2/sae-but2-1_presta.png",
      "Préstataires - inscription": "images/projects/BUT/BUT2/sae-but2-1_presta_inscription.png",
      "Organisateurs - dashboard": "images/projects/BUT/BUT2/sae-but2-1_orga.png",
      "Visiteurs - page d'accueil": "images/projects/BUT/BUT2/sae-but2-1_home.png",
      "Visiteurs - carte interactive": "images/projects/BUT/BUT2/sae-but2-1_carte.png",
      "Visiteurs - attractions": "images/projects/BUT/BUT2/sae-but2-1_attractions.png",
      "Visiteurs - commentaires": "images/projects/BUT/BUT2/sae-but2-1_commentaires.png",
      "Visiteurs - e-billet": "images/projects/BUT/BUT2/sae-but2-1_ebillet.png",
      "BurnUp Chart": "images/projects/BUT/BUT2/sae-but2-1_burnup.png"
    }
  },
  {
    "id": 7,
    "title": "Gestion de projet informatique",
    "bio": "Gérer et conduire un projet informatique",
    "image": "images/projects/BUT/BUT1/sae-but1-s205_logo.png",
    "tags": ["BUT1"],
    "body": [
      {"title": "Contexte", "description": "Ce projet de 1ère année de BUT Informatique consiste, à partir d’un Contexte, d’analyser les besoins de l’entreprise, de rédiger un cahier des charges ainsi qu’un dossier de gestion de projet pour le projet de site de e-commerce réalisé en BUT1."},
      {"title": "Travail réalisé", "description": "Ce projet a été réalisé par groupe de 4 :\n\n- Rédaction du cahier des charges (MOE et MOA)\n- Rédaction du PAQL (Plan Assurance Qualité Logiciel)\n- Rédaction d'un buisness plan"},
      {"title": "Travail personnel", "description": "Personnelement, je me suis occupé de la rédaction du cahier des charges dans son intégralité ainsi que le buisness plan après avoir fait une analyse approfondie du marché du e-commerce."}
    ],
    "competences": [
      "Rédaction de rapports",
      "Conception cahier des charges",
      "Analyse économique d'un marché"
    ],
    "files": {
      "Cahier des charges": "files/BUT/BUT1/sae-but1-s205_cahier_des_charges.pdf",
      "PAQL": "files/BUT/BUT1/sae-but1-s205_PAQL.pdf",
      "Business plan": "files/BUT/BUT1/sae-but1-s205_business_plan.pdf"
    }
  },
  {
    "id": 6,
    "title": "Site e-commerce",
    "bio": "Développement d'un site de vente de téléphones.",
    "tags": ["BUT1"],
    "body": [
      {"title": "Contexte", "description": "Ce projet de 1ère année de BUT Informatique consiste au développement d'un site de e-commerce à partir d'un code source du client. Le client souhaite pouvoir rendre son site fonctionnel pour ses clients mais également pour ses employers."},
      {"title": "Travail réalisé", "description": "La première partie de ce projet fut réalisée par groupe de 4 afin de rendre le site fonctionnel dans une première version. Ainsi nous-avons:\n\n- Analyser le cahier des charges et le code source\n- Créer les bases de données nécessaires\n- Implanter les requêtes SQL\n- Créer un système de connexion des clients et des administrateurs\n- Développer les fonctionnalitées attendues sur un site de e-commerce"},
      {"title": "Travail personnel", "description": "La deuxième partie individuelle du projet consiste à ajouter des fonctionnalités souhaitées par le client. Personnellement je me suis occupé d'ajouter la possibilité pour un client d'écrire des commentaires et de donner des notes ainsi que des 'likes' aux articles. J'ai également créer une visualisation pour les administrateurs à travers un graphe regroupant le nombre de commentaires par article."}
    ],
    "competences": [
      "Travailler dans une équipe",
      "Respecter un cahier des charges et un code source imposé",
      "SQL",
      "Python (Flask)",
      "HTML",
      "Présenter le projet en anglais"
    ],
    "images": {
      "Articles en vente": "images/projects/BUT/BUT1/sae-but1-s204_vueGlobale.png",
      "Détail article": "images/projects/BUT/BUT1/sae-but1-s204_vueDetail.png",
      "Graphe de visualisation": "images/projects/BUT/BUT1/sae-but1-s204_graphe.png"
    }
  },
  {
    "id": 5,
    "title": "Technicien réseau",
    "bio": "Choix, configuration et installation d'un environnement de travail pour un client.",
    "image": "images/projects/BUT/BUT1/sae-but1-s203_logo.png",
    "tags": ["BUT1"],
    "body": [
      {"title": "Contexte", "description": "Ce projet de 1ère année de BUT Informatique consiste, en partant d’un besoin exprimé d’un client, d'installer et de configurer des services réseau permettant de développer ou de déployer des applications informatiques communicantes."},
      {"title": "Travail réalisé", "description": "Ce projet réalisé par groupe de 4 se décompose en plusieurs attendus :\n\n- Compte rendu de choix des services adaptés\n- Compte rendu de déploiement et de tests\n- Définition des besoins\n- Présentation orale"},
      {"title": "Travail personnel", "description": "Personnelement je me suis occupé de la rédaction du cahier des charges ainsi que du compte rendu du choix des services afin d'héberger et de faire fonctionner le projet de site de e-commerce de BUT1."}
    ],
    "competences": [
      "Rédaction de rapport",
      "Analyse d'un choix d'hébergement",
      "Compréhension du fonctionnement réseau d'un site"
    ],
    "files": {
      "Rapport besoins": "files/BUT/BUT1/sae-but1-s203_besoins.pdf",
      "Rapport solution": "files/BUT/BUT1/sae-but1-s203_services.pdf"
    }
  },
  {
    "id": 4,
    "title": "Site Vitrine",
    "bio": "Création d'un site web statique",
    "tags": ["BUT1"],
    "body": [
      {"title": "Contexte", "description": "Ce projet de 1ère année de BUT Informatique a pour objet, en début de formation, de nous exercer au développement web avec les languages HTML et CSS. L'objectif est de créer le site web d'une entreprise pour la rendre plus visible."},
      {"title": "Travail réalisé", "description": "Ce projet a été réalisé par groupe de 4 et décomposé en plusieurs étapes:\n\n- Recherche d'une entreprise et documentation\n- Rédaction d'un rapport économique de l'entreprise\n- Création du site web"},
      {"title": "Travail personnel", "description": "Personnellement j'ai travaillé sur la rédaction du rapport économique du projet ainsi que sur le développement des parties \"Qui sommes-nous\" et \"Accueil\" du site web. J'ai également instaurer une charte graphique en accord avec mes collègues afin de nous permettre de tous développer dans le même sans. J'ai également élargi mes connaissances avec l'utilisation du framework Bootstrap CSS."}
    ],
    "competences": [
      "Travail dans une équipe",
      "Maitrise rédactionnelle",
      "HTML",
      "CSS",
      "Utilisation d'un framework"
    ],
    "images": {
      "Page d'accueil": "images/projects/BUT/BUT1/sae-but1-s106_home.png",
      "Page de présentation": "images/projects/BUT/BUT1/sae-but1-s106_page.png"
    },
    "files": {
      "Rapport économique": "files/BUT/BUT1/sae-but1-s106_rapport_economique.pdf"
    }
  },
  {
    "id": 3,
    "title": "Gestion de projet",
    "bio": "Gérer et conduire un projet.",
    "tags": ["BUT1"],
    "body": [
      {"title": "Contexte", "description": "L'objectif de ce projet de 1ère année de BUT Informatique est de formalisé les besoins d'un client et de conduire un projet pour y répondre."},
      {"title": "Choix du sujet", "description": "Organiser un événement pour l’ouverture d’un magasin de jeux vidéo et de plateau."},
      {"title": "Travail réalisé", "description": "Afin de mener à bien ce projet, plusieurs étapes ont été nécessaire :\n\n- Rédaction d'un questionnaire pour le commanditaire du projet\n- Organisation du groupe de travail et du planning (Gant)\n- Recherche d'informations\n- Conception d'une solution répondant au besoin\n- Soutenance du projet"},
      {"title": "Travail personnel", "description": "Lors de ce projet, j'ai participé à la rédaction du questionnaire client et aux recherches de solutions. Je me suis occupé de la partie communication et est effectué plusieurs recherches afin d'élaboré plusieurs tableau conçernant la portée du plan de comm, les différentes options possibles et le coût. J'ai également réalisé un diaporama pour la soutenance."}
    ],
    "competences": [
      "Travail dans une équipe",
      "Gestion de projet",
      "Analyse d'informations",
      "Présentation soutenance"
    ],
    "images": {
      "Diagramme de Gant": "images/projects/BUT/BUT1/sae-but1-s105_gant.png"
    },
    "files": {
      "Questionnaire client": "files/BUT/BUT1/sae-but1-s105_questionnaire.pdf",
      "Planning (GANT)": "files/BUT/BUT1/sae-but1-s105_planning.pdf",
      "Solutions": "files/BUT/BUT1/sae-but1-s105_solutions.pdf",
      "Soutenance": "files/BUT/BUT1/sae-but1-s105_soutenance.pdf"
    }
  },
  {
    "id": 2,
    "title": "Interface CRUD",
    "bio": "Création d'une interface CRUD pour un centre de collecte et de tri des déchets.",
    "tags": ["BUT1"],
    "body": [
      {"title":"Contexte", "description":"L'objectif de ce projet de 1ère année de BUT Informatique est de produire un système d'information répondant aux besoins d'un client travaillant dans un centre de collecte et de tri des déchets."},
      {"title":"Travail réalisé", "description":"Ce projet à necessité plusieurs étapes afin de répondre au besoin du client:\n\n- La création d'un modèle conceptuel de données (MCD) afin de rendre compte de l'entièrté du projet en aval de sa réalisation\n- La création des tables de la base de données établie auparavant dans le language SQL\n- La création d'un site web pythonFlask hébergé sur github utilisant la nouvelle base de données et répondant aux attentes du client"},
      {"title":"Travail personnel", "description":"J'ai premièrement conçu le modèle conceptuel de données afin de pouvoir le retranscrire en tables dans sql. Je me suis occuper de la partie du site web comprenant la gestion des contenaires et de leurs déchets en incluant des fonctions d'agrégations pour calculer le poid des déchets, ainsi que la création de formulaire pour ajouter de nouvelles entitées. J'ai églement réalisé le rapport."}
    ],
    "competences": [
      "Mettre à jour et interroger une base de données relationnelle",
      "Concevoir une base de données relationnelle à partir d’un cahier des charges"
    ],
    "images": {
      "MCD": "images/projects/BUT/BUT1/sae-but1-s104_MCD.png"
    },
    "files": {
      "Rapport": "files/BUT/BUT1/sae-but1-s104_Analyse.pdf"
    }
  },
  {
    "id": 1,
    "title": "Jeu du Jeton manquant",
    "bio": "Création d'un jeu de plateau Java",
    "tags": ["BUT1"],
    "body": [
      {"title":"Contexte", "description":"L’objectif de ce projet de 1ère année de BUT Informatique est de programmer un jeu « Jeu du Jeton manquant » dans le langage de programmation Java à partir d’un squelette de code ainsi que des variables imposées. Le travail s’effectue par binôme dans un délai de 4 semaines."},
      {"title":"Règle du Jeu", "description":"Chaque joueur place leur pion chacun leur tour sur une case du plateau, les pions allant de 1 à 10, le but du jeu est d'avoir le moins de point possible autour de la dernière case manquante."},
      {"title":"Travail réalisé", "description":"Ce projet à été décomposé en plusieurs étapes afin de  structuré le travail réalisé :\n\n- Initialisation du plateau de jeu et du système de placement des jetons \n- Création d'un système d'alternance de tour des joueurs\n- Création d'une méthode de calcul des points de chaque joueur\n- Correction des failles du code lié aux possibles erreurs d'entré de l'utilisateur\n- Travail sur l'aspect esthétique du jeu\n- Rapport en anglais du projet rendu"},
      {"title":"Travail personnel", "description":"Mes principales missions durant ce projet était de performé mes compétences dans le language java afin d'aboutir au résultat escompté. J'ai réaliser les méthodes de génération du plateau et de calcul des points ainsi que le rapport en anglais du projet. J'ai également documenté le code et normé les méthodes."}
    ],
    "competences": [
      "Implémentation d’un besoin client",
      "Développement d'une interface interactive de jeu",
      "Travail dans une équipe informatique",
      "Java"
    ],
    "images": {
      "Rendu 1 (fin)": "images/projects/BUT/BUT1/sae-but1-s101_FinPartie.png",
      "Rendu 2 (cas erreur)": "images/projects/BUT/BUT1/sae-but1-s101_erreur.png"
    },
    "files": {
      "Code source": "files/BUT/BUT1/Jeton.java"
    }
  }
]